In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#CREATE 2 series
ser1 = Series([0,1,2], index = ['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2 = Series([3,4,5,6], index=['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
#adding them together
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [6]:
#dataframes 
dFrame1 = DataFrame(np.arange(4).reshape((2,2)),columns=list('AB'),index=['NYC','LA'])
dFrame1

     A  B
NYC  0  1
LA   2  3

In [7]:
dFrame2 = DataFrame(np.arange(9).reshape((3,3)),columns=list('ADC'),index=['NYC','SF','LA'])
dFrame2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [8]:
#what happens when we ad dframe1 to dframe2
dFrame1 + dFrame2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [9]:
#replace the null values 
dFrame1

     A  B
NYC  0  1
LA   2  3

In [10]:
#replace the null values - we can add it directly. 
# it fills in zeros to see and not loose values
dFrame1.add(dFrame2, fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [11]:
dFrame2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [12]:
#create new series
ser3 = dFrame2.iloc[0]

In [13]:
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [14]:
#removes the values 
dFrame2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6